# WitnsLineExtension Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WitnsLineExtension Property
ParameterTypeId Class See Also
---
"Witness Line Extension"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WitnsLineExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WitnsLineExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WitnsLineExtension {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace